# 人机交互界面测试自动生成
rj_data = [
    {
        "desgin_name": "人机交互完整性",
        "test_item_name": "人机交互完整性测试",
        "ident": "WZXC",
        "xq_desc": "测试软件人机交互界面的完整性",
        "chongfen": "测试用例覆盖人机交互界面完整性子项要求的全部内容。\a"
                    "所有用例执行完毕，对于未执行的用例说明未执行原因。",
        "test_method": [
            {
                "caozuo": "检查界面菜单名称、标签名称、按键名称的完整性",
                "yuqi": "名称完整"
            },
            {
                "caozuo": "检查界面显示区内容的完整性",
                "yuqi": "显示内容完整"
            },
            {
                "caozuo": "检查界面菜单功能的完整性",
                "yuqi": "菜单功能完整"
            },
        ]
    },
    {
        "desgin_name": "人机交互界面一致性",
        "test_item_name": "人机交互界面一致性测试",
        "ident": "YZXC",
        "xq_desc": "测试软件人机交互界面的一致性",
        "chongfen": "测试用例覆盖人机交互界面一致性子项要求的全部内容。\a"
                    "所有用例执行完毕，对于未执行的用例说明未执行原因。",
        "test_method": [
            {
                "caozuo": "检查主界面的标题栏与使用说明书的一致性",
                "yuqi": "主界面的标题栏与用户手册一致"
            },
            {
                "caozuo": "检查次级界面、对话框等标题与使用说书的一致性",
                "yuqi": "次级界面、对话框等标题与用户手册一致"
            },
            {
                "caozuo": "检查界面用语与使用说明书的一致性",
                "yuqi": "界面用语与用户手册一致"
            },
            {
                "caozuo": "检查界面的字体、颜色、位置等是否统一、字体是否对齐",
                "yuqi": "界面的字体、颜色、位置等与用户手册一致"
            },
            {
                "caozuo": "检查同类数据的显示精度是否正确、统一",
                "yuqi": "同类数据的显示精度与用户手册一致，精确并统一"
            },
        ]
    },
    {
        "desgin_name": "人机交互界面友好性",
        "test_item_name": "人机交互界面友好性测试",
        "ident": "YHXC",
        "xq_desc": "测试软件人机交互界面的友好性",
        "chongfen": "测试用例覆盖人机交互界面友好性子项要求的全部内容。\a"
                    "所有用例执行完毕，对于未执行的用例说明未执行原因。",
        "test_method": [
            {
                "caozuo": "检查界面实时显示信息区是否实时刷新",
                "yuqi": "实时刷新"
            },
            {
                "caozuo": "检查提示信息显示位置是否合理、提示框或弹窗是否居中显示",
                "yuqi": "合理、弹窗居中"
            },
            {
                "caozuo": "检查界面用语、名称等是否存在错别字、乱码等",
                "yuqi": "无错别字或乱码"
            },
            {
                "caozuo": "检查界面字符显示是否清晰",
                "yuqi": "字符显示清晰"
            },
            {
                "caozuo": "检查界面字符或提示语是否统一、汉化",
                "yuqi": "统一汉化显示"
            },
        ]
    },
    {
        "desgin_name": "人机交互界面易操作性",
        "test_item_name": "人机交互界面易操作性测试",
        "ident": "YCZX",
        "xq_desc": "测试软件人机交互界面的易操作性",
        "chongfen": "测试用例覆盖人机交互界面易操作性子项要求的全部内容。\a"
                    "所有用例执行完毕，对于未执行的用例说明未执行原因。",
        "test_method": [
            {
                "caozuo": "检查界面菜单、图标、按键等是否分布整齐、有序",
                "yuqi": "分布整齐有序"
            },
            {
                "caozuo": "检查菜单深度的合理性",
                "yuqi": "菜单深度不超过3级"
            },
        ]
    },
    {
        "desgin_name": "人机交互界面操作测试",
        "test_item_name": "人机交互界面操作测试测试",
        "ident": "CZCC",
        "xq_desc": "测试软件人机交互的界面操作测试",
        "chongfen": "测试用例覆盖人机交互界面操作测试子项要求的全部内容。\a"
                    "所有用例执行完毕，对于未执行的用例说明未执行原因。",
        "test_method": [
            {
                "caozuo": "检查按键、编辑框等使能情况（闪烁）",
                "yuqi": "闪烁"
            },
            {
                "caozuo": "执行任务期间，进行按键的多处连击",
                "yuqi": "不会出现假死或崩溃"
            },
            {
                "caozuo": "检查列表，列表中的内容允许编辑、数据变更后自动更新显示",
                "yuqi": "内容允许编辑、数据变更后自动更新显示"
            },
            {
                "caozuo": "能够进行选择和取消，选择及取消后处理正确",
                "yuqi": "能够进行选择和取消，选择及取消后处理正确"
            },
            {
                "caozuo": "选择或取消某个单选框后再进行复选操作",
                "yuqi": "操作正确"
            },
            {
                "caozuo": "执行一个任务，查看界面操作及显示的正确性",
                "yuqi": "界面操作及显示正确"
            },
            {
                "caozuo": "在一个菜单功能项执行过程中用使用按钮选择其他功能",
                "yuqi": "不会出现假死或崩溃情况"
            },
        ]
    },
]
